/* 
Завдання 4.

Необхідно реалізувати наступний функціонал як на відео text, а саме:

на сторінці знаходиться список ol з 6ма кольорами, написаними англійською мовою.
потрібно щоб в при кліку на поточний пункт замалювався тим кольором, який в ньому записаний.
постарайтесь зробити даний функціонал використовуючи тільки одну функцію
*/



let count = 0;
function colorText() {
  if (event.target.style.color !== event.target.textContent) {
    event.target.style.color = event.target.textContent;
  } 
}



